Revit 2027 API
SweptBlend.BottomProfileSymbol Property
The bottom family symbol profile of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbolProfile BottomProfileSymbol { get; }
Public ReadOnly Property BottomProfileSymbol As FamilySymbolProfile
	Get
public:
property FamilySymbolProfile^ BottomProfileSymbol {
	FamilySymbolProfile^ get ();
}
member BottomProfileSymbol : FamilySymbolProfile with get
Property Value
FamilySymbolProfile
Remarks
If the bottom profile is sketch-based, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace